# __Reading external data and plotting__

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as pl

In [7]:
data=pd.read_csv("data/btc-market-price.csv")

In [8]:
data.head()

   2017-04-02 00:00:00  1099.169125
0  2017-04-03 00:00:00  1141.813000
1  2017-04-04 00:00:00  1141.600363
2  2017-04-05 00:00:00  1133.079314
3  2017-04-06 00:00:00  1196.307937
4  2017-04-07 00:00:00  1190.454250

In [9]:
data=pd.read_csv("data/btc-market-price.csv",header=None)

In [10]:
data.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [11]:
data.columns=["Timestamp","Price"]

In [15]:
data.shape

(365, 2)

In [13]:
data.tail()

               Timestamp        Price
360  2018-03-28 00:00:00  7960.380000
361  2018-03-29 00:00:00  7172.280000
362  2018-03-30 00:00:00  6882.531667
363  2018-03-31 00:00:00  6935.480000
364  2018-04-01 00:00:00  6794.105000

In [17]:
data.dtypes

Timestamp     object
Price        float64
dtype: object

In [21]:
pd.to_datetime(data["Timestamp"]).head()

0   2017-04-02
1   2017-04-03
2   2017-04-04
3   2017-04-05
4   2017-04-06
Name: Timestamp, dtype: datetime64[ns]

In [22]:
data["Timestamp"]=pd.to_datetime(data["Timestamp"])

In [23]:
data.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [24]:
data.set_index("Timestamp",inplace=True)

In [26]:
data.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937

In [29]:
data.loc["2017-12-12"]

Price    17276.393333
Name: 2017-12-12 00:00:00, dtype: float64

## __Putting Everything together__

In [33]:
data=pd.read_csv("data/btc-market-price.csv",header=None)
data.columns=["Timestamp","Price"]
data["Timestamp"]=pd.to_datetime(data["Timestamp"])
data.set_index("Timestamp",inplace=True)

In [34]:
data.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937

### __Everything can be done in the read_csv function__ too

In [36]:
data=pd.read_csv(
    "data/btc-market-price.csv",
    header=None,
    names=['Timestamp','Price'],
    index_col=0,
    parse_dates=True
)

In [37]:
data.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937

# __Basics of Plotting__